Repository: lgtm-migrator/ww-yubico-otp
Catalog: lang/ww-yubiotp-admin-*.po
Languages: ru_ru, uk

source: Provides support for the Yubico OTP authentication
ru_ru: Поддержка аутентификации посредством Yubico OTP
uk: Підтримка автентифікації за допомогою Yubico OTP

source: Volodymyr Kolesnykov
ru_ru: Владимир Колесников
uk: Володимир Колесников

source: There was an error communicating with the server.
ru_ru: Произошла ошибка связи с сервером.
uk: Під час спілкування з сервером сталася помилка.

source: Are you sure you want to revoke this key?
ru_ru: Вы уверены, что хотите отозвать данный ключ?
uk: Дійсно скасувати цей ключ?

source: Client ID
ru_ru: ID клиента
uk: ID клієнта

source: Secret Key
ru_ru: Секретный ключ
uk: Секретний ключ

source: If left blank, it will be impossible to verify the integrity of server responses
ru_ru: Если поле оставить пустым, проверка целостности ответов сервера выполняться не будет
uk: Якщо поле залишити порожнім, перевірка цілісності відповідей сервера виконуватися не буде

source: API Endpoint
ru_ru: Адреса API
uk: Кінцева точка API

source: Leave blank to use YubiCloud servers.
ru_ru: Оставьте поле пустым, чтобы использовать сервера YubiCloud.
uk: Залиште поле порожнім, щоб використовувати сервера YubiCloud.

source: Required parameter missing.
ru_ru: Требуемый параметр отсутствует.
uk: Необхідний параметр відсутній.

source: CSRF token does not match. Please reload the page.
ru_ru: Токен CSRF не совпадает. Пожалуйста, перезагрузите страницу.
uk: Маркер CSRF не збігається. Будь ласка, перезавантажте сторінку.

source: Key Name
ru_ru: Имя ключа
uk: Назва ключа

source: Key ID
ru_ru: ID ключа
uk: ID ключа

source: Created
ru_ru: Создан
uk: Створений

source: Last Used
ru_ru: Последнее использование
uk: Останне використовування

source: Revoke
ru_ru: Отозвать
uk: Скасувати ключ

source: Incorrect one time password.
ru_ru: Неверный одноразовый пароль.
uk: Неправильний одноразовий пароль.

source: This key already exists.
ru_ru: Такой ключ уже есть.
uk: Цей ключ вже існує.

source: There was an error processing your request.
ru_ru: Произошла ошибка при обработке запроса.
uk: Під час обробки вашого запиту сталася помилка.

source: The key has been successfully added.
ru_ru: Ключ успешно добавлен.
uk: Ключ успішно додано.

source: The key has been successfully revoked.
ru_ru: Ключ успешно отозван.
uk: Ключ успішно скасовано.

source: Done.
ru_ru: Выполнено.
uk: Виконано.

source: You can sign up for the Client ID and Secret Key <a href="https://upgrade.yubico.com/getapikey/" target="_blank" rel="noopener">here</a>.
ru_ru: Получить ID клиента и Секретный ключ можно перейдя по <a href="https://upgrade.yubico.com/getapikey/" target="_blank" rel="noopener">этой ссылке</a>.
uk: <a href="https://upgrade.yubico.com/getapikey/" target="_blank" rel="noopener">Тут </a> можна отримати ідентифікатор клієнта та секретний ключ.

source: Please make sure that Client ID matches the API Endpoints.
ru_ru: Убедитесь, что ID клиента соответствует адресам API.
uk: Переконайтеся, що ID клієнта відповідає кінцевим точкам API.

source: This page needs JavaScript.
uk: Ця сторінка потребує JavaScript.

source: Registered Keys
ru_ru: Зарегистрированные ключи
uk: Зареєстровані ключі

source: Add a New Key
ru_ru: Добавить новый ключ
uk: Додадти новий ключ

source: Yubico One Time Password
ru_ru: Одноразовый пароль Yubico
uk: Одноразовий пароль Yubico

source: Please insert and tap your YubiKey to get the one time password.
ru_ru: Для получения одноразового пароля вставьте и коснитесь Вашего ключа YubiKey.
uk: Вставте та торкніться свого ключа YubiKey, щоб отримати одноразовий пароль.

source: Add Key
ru_ru: Добавить ключ
uk: Додати ключ
